[
  {
    "id": "1",
    "name": "ES.next Fundamentals",
    "brief": "Learn how to write cleaner code using arrow functions, destructuring, rest parameters, and other ES.next features to improve your developer speed, functionality, and maintainability.",
    "description": "JavaScript is evolving quickly. The mega ES6 specification was released in 2015 and is quickly being implemented by modern JS interpreters. New versions of ECMAScript will now be released on a yearly basis with new features going through a 4-stage proposal process. We can leverage features in ES6, ES2016, and those slated for future versions right now to write even clearer and more concise React code. Experience with JavaScript will help you get the most out of this hands-on workshop, but you don’t have to have a JavaScript black belt to leave feeling confident in 'ES.next.' Learn how to write cleaner code using arrow functions, destructuring, rest parameters, and other ES.next features you’re likely to use and benefit from on a daily basis while developing with React. Oh, and don’t worry if you didn’t understand any of those terms — you soon will after this workshop.",
    "instructor": "Ben Ilegbodu",
    "img": "ben",
    "title": "Lead Front-end Engineer",
    "company": "Eventbrite",
    "bio": "Ben is a Christian, a husband and a father of 2 with 10+ years of experience developing user interfaces for the Web. He currently leads and manages Eventbrite’s Frontend Platform team. On the side, Ben also enjoys playing basketball, DIY, watching movies, and blogging. He blogs at (benmvp.com) and tweets (@benmvp) about his experiences with new web technologies.",
    "date": "March 7",
    "length": 3,
    "difficulty": "BEGINNER",
    "location": ""
  },
  {
    "id": "2",
    "name": "React.js Fundamentals",
    "brief": "Learn the basics of building Composable UIs in React, by building a real-world application to explore best practices styling, testing, and managing data inside React Components. ",
    "description": "Learn the basics of building Composable UIs in React, by building a real-world application to explore best practices styling, testing, and managing data inside React Components. ",
    "instructor": "Brian Douglas",
    "img": "brian",
    "title": "Senior Engineer",
    "company": "Netlify",
    "bio": "Brian is a developer at Netlify, where he was first hired to convert their Angular app to React. Since then he has been working heavily on multiple React apps using Redux, GraphQL/Relay, and a variety of solutions for styling. In his spare time, he mentors new programmers towards contributing in open source as well as JavaScript and React tools.",
    "date": "March 7",
    "length": 5,
    "difficulty": "BEGINNER",
    "location": ""
  },
  {
    "id": "3",
    "name": "Integrate Redux into your React App",
    "brief": "Simplify your state management and application scalability with the most popular implementation of the Flux architecture, Redux. Learn Redux as we integrate it into a full-stack application boilerplate.",
    "description": "For those who are already comfortable with React, this workshop helps you take your application development to the next level. Redux helps you to simplify your state management, perform asychronous actions, and to assist with scalability, among other benefits. In this workshop, we'll learn Redux by implementing it into a full-stack e-commerce app built with React.",
    "instructor": "Berkeley Martinez",
    "img": "berks",
    "title": "CTO",
    "company": "freeCodeCamp",
    "bio": "Berkeley is the CTO of freecodecamp.com, a free online community for learning full-stack web development where students garner real-world experience by engineering solutions for nonprofit companies. He has been programming with React for over three years, and is the author of Redux-Epic, a library built to do better async and server-side rendering in React with RxJS Observables. He is also a partner at Real World React, where he consults individuals and businesses looking to become experts in the React ecosystem. He has trained engineers from Twilio, NerdWallet, Netflix, Tesla, Amazon, and more.",
    "date": "March 8",
    "length": 8,
    "difficulty": "INTERMEDIATE",
    "location": ""
  },
  {
    "id": "4",
    "name": "Webpacking",
    "brief": "Set yourself apart and take control of the most popular module bundler for React apps - Webpack. While others struggle to reconfigure their boilerplate code, you'll be writing custom solutions to be ahead of the game.",
    "description": "With all the buzzwords flying around the Javascript/React ecosystem, Webpack is one that is difficult to shake intimidation. Some of us grabbed an example configuration to get our app running or used its' middleware in conjunction with some legacy build tools. But most of us haven't really taken the time to understand why it's emerging as the dominant build tool for modular Javascript applications. In this workshop we are going shed this intimidation and unlock the full power of Webpack. By the time you leave, you should feel comfortable building and understanding the basics of a Webpack configuration and iterating on it to unlock more features as your application demands.",
    "instructor": "Muhsin Abdul-Musawwir",
    "img": "moose",
    "title": "Front-end Engineer",
    "company": "Esurance",
    "bio": "Muhsin \"Moose\" is a Front End Engineer at Esurance Working in React and Node. He has a passion for tooling, workflows, awesome build pipelines, and learning/teaching new technologies.",
    "date": "March 9",
    "length": 4,
    "difficulty": "INTERMEDIATE",
    "location": ""
  },
  {
    "id": "5",
    "name": "Serverless Apps with AWS Lambda & React",
    "brief": "AWS Lambda takes cloud computing to the next level by empowering you to run full-stack applications without the need to provision or manage servers. The Serverless Framework is an open source technology that facilitates building serverless architectures on Lambda & more.",
    "description": "We all know how AWS revolutionized the way we build and deploy software applications. It reduced the barrier to entry by eliminating the need to purchase or maintain physical servers. But Lambda takes it a step further. In this workshop, you'll learn how to deploy your applications as independent functions that respond to events, charge you only when they run, and scale automatically. The open source Serverless Framework helps to facilitate this and simplifies the deployment to Lambda -- all from the comfort of your command line.",
    "instructor": "David Wells",
    "img": "david",
    "title": "Software Engineer",
    "company": "Serverless",
    "bio": "David is a full stack developer at Serverless, Inc. in San Francisco. He is passionate about developer experience and creating products that are powerful and easy to use. His previous roles include lead UI/UX developer at Mulesoft and founder of Inbound Now, an open source marketing software platform. He specialized in JavaScript, HTML, CSS, Marketing, and UI/UX.",
    "date": "March 9",
    "length": 4,
    "difficulty": "INTERMEDIATE",
    "location": ""
  },
  {
    "id": "6",
    "name": "Going Native with React",
    "brief": "React Native is the framework for building native applications for iOS, Android, and Windows Mobile with only JavaScript. With React Native you can learn once and write anywhere.",
    "description": "With React Native, you don't build a “mobile web app”, an “HTML5 app”, or a “hybrid app”. You build a real mobile app that's indistinguishable from an app built using Objective-C or Java. React Native uses the same fundamental UI building blocks as regular iOS and Android apps. You just put those building blocks together using JavaScript and React. In this workshop you'll learn from a React Native core-contributor as he guides you through the framework, ecosystem, syntax, and best practices to build a real-world application.",
    "instructor": "Mike Grabowski",
    "img": "mike",
    "title": "CTO",
    "company": "Callstack.io",
    "bio": "Mike is a React Native Core Contributor and Co-Founder at Callstack.io - a React Native dev shop based in Europe delivering great React experience to people all over the globe. Being involved in React ecosystem, Mike is responsible for releasing new versions of React Native along with the changelogs. He created `rnpm`, a tool for managing native code that made it easy to extend React Native apps just a matter of a single command. In his free time, he does even more open source by contributing to projects like react-navigation.",
    "date": "March 10",
    "length": 8,
    "difficulty": "INTERMEDIATE",
    "location": ""
  },
  {
    "id": "7",
    "name": "RxJS & Redux-Observable",
    "brief": "Take your React & Redux apps to the next level. Learn to perform asynchronous data-fetching and server-side rendering, among other benefits, with RxJS Observables.",
    "description": "RxJS & Redux-Observable provide: Complex side-effects and asynchronous data-fetching, Declarative AJAX cancellation, Debounced or throttled form submissions, Isolate redux side effects into easily testable and idempotent functions, and Improved server-side rendering developer experience. This is thanks in large part to observables. Observables are similar to promises with a few key improvements. With observables, you get: Success, failure, and completion event streams, Apply familiar array methods to event handlers, Composable event handlers, Return any number of values over any amount of time, Declarative cancellation, Laziness -- they won't do anything until you subscribe to them.",
    "instructor": "Berkeley Martinez",
    "img": "berks",
    "title": "CTO",
    "company": "freeCodeCamp",
    "bio": "Berkeley is the CTO of freecodecamp.com, a free online community for learning full-stack web development where students garner real-world experience by engineering solutions for nonprofit companies. He has been programming with React for over three years, and is the author of Redux-Epic, a library built to do better async and server-side rendering in React with RxJS Observables. He is also a partner at Real World React, where he consults individuals and businesses looking to become experts in the React ecosystem. He has trained engineers from Twilio, NerdWallet, Netflix, Tesla, Amazon, and more.",
    "date": "March 10",
    "length": 8,
    "difficulty": "ADVANCED",
    "location": ""
  }
]
